hell_yeah/app/controllers/statements_controller.rb

SELECT "statements".* FROM "statements"
---
  def index
    @statements = Statement.all

SELECT "statements".* FROM "statements" WHERE "statements"."id" = 1 LIMIT 1
---
  def show
    @statement = Statement.find(params[:id])

SELECT "statements".* FROM "statements" WHERE "statements"."id" = 3 LIMIT 1
---
  def edit
    @statement = Statement.find(params[:id])

INSERT INTO "statements" ("text", "created_at", "updated_at") VALUES ('Testing is overrated.', '2011-04-21 07:37:45.179084', '2011-04-21 07:37:45.179084')
---
  def create
    @statement = Statement.new(params[:statement])

    respond_to do |format|
      if @statement.save

SELECT "statements".* FROM "statements" WHERE "statements"."id" = 3 LIMIT 1
UPDATE "statements" SET "text" = 'Talks are hard, let''s go shopping!', "updated_at" = '2011-04-21 14:18:40.377329' WHERE "statements"."id" = 3
---
  def update
    @statement = Statement.find(params[:id])

    respond_to do |format|
      if @statement.update_attributes(params[:statement])