hell_yeah/app/controllers/votes_controller.rb

SELECT "statements".* FROM "statements" WHERE "statements"."id" IS NULL LIMIT 1
INSERT INTO "users" ("screen_name", "name", "created_at", "updated_at") VALUES ('mbleigh', 'Michael Bleigh', '2011-04-21 08:10:52.890668', '2011-04-21 08:10:52.890668')
INSERT INTO "votes" ("user_id", "statement_id", "created_at", "updated_at") VALUES (1, 1, '2011-04-21 08:10:52.998005', '2011-04-21 08:10:52.998005')
---
  def create
    redirect_to('/', :alert => 'No statement was selected to vote for.') and return unless session[:last_statement_id]
    @user = User.from_auth(auth)
    @statement = Statement.find_by_id(session.delete(:last_statement_id))
    @vote = Vote.new(:user => @user, :statement => @statement)

    if @vote.save